---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures
source: html/e5bf57e3-57bd-582e-f29b-1b644ba6a6c5.htm
---
# BuiltInFailures.AnalyticalModelFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.